## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 1 to change, 4 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "api"
        tags                           = {}
        # (24 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "SQLALCHEMY_DATABASE_URI" = (sensitive)
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_security_group.api_lambda will be destroyed
  - resource "aws_security_group" "api_lambda" {
      - arn                    = "arn:aws:ec2:ca-central-1:507252742351:security-group/sg-0592826f09bf19fc7" -> null
      - description            = "Security group that is to be attached to the api lambda" -> null
      - egress                 = [] -> null
      - id                     = "sg-0592826f09bf19fc7" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-03e8be52c7b5dd6cb",
                ]
              - self             = false
              - to_port          = 5432
            },
        ] -> null
      - name                   = "terraform-20210803144826255600000001" -> null
      - name_prefix            = "terraform-" -> null
      - owner_id               = "507252742351" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "api_lambda_sec_group"
        } -> null
      - tags_all               = {
          - "Name" = "api_lambda_sec_group"
        } -> null
      - vpc_id                 = "vpc-095a761b6add80a7b" -> null
    }

  # aws_security_group_rule.api_to_rds will be destroyed
  - resource "aws_security_group_rule" "api_to_rds" {
      - cidr_blocks              = [] -> null
      - from_port                = 5432 -> null
      - id                       = "sgrule-3944135683" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0592826f09bf19fc7" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-03e8be52c7b5dd6cb" -> null
      - to_port                  = 5432 -> null
      - type                     = "ingress" -> null
    }

  # module.rds.aws_secretsmanager_secret_version.connection_string must be replaced
-/+ resource "aws_secretsmanager_secret_version" "connection_string" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:507252742351:secret:scan-websites-zl9eef-rbIlJ9" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:507252742351:secret:scan-websites-zl9eef-rbIlJ9|1D9D350C-125C-411F-B9C0-271C6D5E17F6" -> (known after apply)
      - secret_binary  = (sensitive value)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "1D9D350C-125C-411F-B9C0-271C6D5E17F6" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.rds.aws_secretsmanager_secret_version.proxy_connection_string must be replaced
-/+ resource "aws_secretsmanager_secret_version" "proxy_connection_string" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:507252742351:secret:scan-websites-zl9eef-proxy-connection-string-QEE9Mq" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:507252742351:secret:scan-websites-zl9eef-proxy-connection-string-QEE9Mq|ED0238A3-9460-402E-A5DD-F5228F32A9F9" -> (known after apply)
      - secret_binary  = (sensitive value)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "ED0238A3-9460-402E-A5DD-F5228F32A9F9" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>